import { IAllowAndNotAllowData } from "../interfaces";


export const allowAndNotAllowData: IAllowAndNotAllowData = {
    allow: {
        food: ["الخضروات الورقية مثل السبانخ.",
            "التوت مثل التوت الأزرق.",
            "الدهون الصحية مثل زيت الزيتون والأفوكادو.",
            "السمك مثل السلمون والتونة.",
            "الدجاج المشوي أو المسلوق.",
            "المكسرات مثل اللوز والكاجو.",
            "الحبوب الكاملة مثل الشوفان.",
            "البقوليات مثل الفاصوليا والعدس.",
            "الفواكه منخفضة البوتاسيوم مثل التفاح والعنب.",
            "الحليب قليل الدسم أو البدائل النباتية مثل حليب اللوز.",
            "الفواكه منخفضة البوتاسيوم مثل التفاح والعنب."
        ],
        drinks: ["شاي الأعشاب مثل شاي النعناع أو الكاموميل.",
            "حليب جوز الهند غير المحلى.",
            "شاي التوت البري أو شاي الفواكه الطبيعية.",
            "ماء جوز الهند (بدون إضافات).",
            "شاي الأخضر (بكميات معتدلة).",
            "حليب جوز الهند غير المحلى.",
            "حليب اللوز غير المحلى.",
            "عصير التفاح الطبيعي (بدون سكر مضاف)."
        ]
    },
    notAllow: {
        food: ["اللحوم المدخنة.",
            "اللحوم الحمراء.",
            "الأطعمة المقلية.",
            "منتجات الألبان كاملة الدسم.",
            "الأطعمة الغنية بالفوسفور مثل الجبن.",
            "الأطعمة الغنية بالبوتاسيوم مثل الموز والبطاطس.",
            "الأطعمة المعلبة أو المعالجة.",
            "الفواكه الغنية بالبوتاسيوم مثل الموز والبرتقال.",
            "الأطعمة الغنية بالملح مثل الوجبات السريعة.",
            "الشوكولاتة (وخاصة الأنواع الغنية بالسكر).",
            "المكملات الغذائية المحتوية على الفوسفور."
        ],
        drinks: ["المشروبات الغازية مثل الكولا.",
            "عصير البرتقال (قد يحتوي على مستويات عالية من البوتاسيوم).",
            "عصير الموز (غني بالبوتاسيوم).",
            "القهوة (بكميات كبيرة، خاصة إذا كانت تحتوي على الكافيين).",
            "المشروبات المحلاة بالسكريات الصناعية مثل مشروبات الدايت.",
            "عصير الكرز (يحتوي على نسبة عالية من البوتاسيوم).",
            "عصير الخوخ (يحتوي على نسبة عالية من البوتاسيوم).",
            "عصير الفراولة (قد يحتوي على كميات عالية من البوتاسيوم)."
        ]
    }
}